package com.example.demo;

import com.alibaba.fastjson.JSON;

/**
 * @author hut
 * @date 2023/4/12 7:01 下午
 */
public class KmmcTest {
    public static void main(String[] args) {
        String str = "1122.147 应收账款_西安益祥仪表有限公司\n" +
                "1122.51 应收账款_安徽淮开电器设备有限公司\n" +
                "1122.148 应收账款_河南郎科电气有限公司\n" +
                "1122.78 应收账款_河北德亚特电器有限公司\n" +
                "1002.01 银行存款_基本户1612\n" +
                "1002.01 银行存款_基本户1612\n" +
                "\n" +
                "2202.120 应付账款_武汉京达远电力安装有限公司\n" +
                "1122.58 应收账款_浙江巨高电力设备有限公司\n" +
                "1122.149 应收账款_郑州郑源电气有限公司\n" +
                "1122.114 应收账款_广东中互电气有限公司\n" +
                "1002.01 银行存款_基本户1612\n" +
                "\n" +
                "1122.85应收账款_温州郎韵工贸\n" +
                "1122.58 应收账款_浙江巨高电力设备有限公司\n" +
                "1122.150 应收账款_成都蜀鑫利电气科技有限公司\n" +
                "1122.54 应收账款_河南省汇科高压电器有限公司\n" +
                "1002.01 银行存款_基本户1612\n" +
                "\n" +
                "1122.151 应收账款_郑州威达电子有限公司\n" +
                "1122.152 应收账款_深圳市科航兴电气有限公司\n" +
                "1122.32 应收账款_新乡市美凯达电气有限公司\n" +
                "1122.78 应收账款_河北德亚特电器有限公司\n" +
                "1002.01 银行存款_基本户1612\n" +
                "\n" +
                "1122.70 应收账款_襄阳双龙威机电科技有限公司\n" +
                "1122.153 应收账款_河南博控电气有限公司\n" +
                "1122.139 应收账款_杭州世杰电气有限公司\n" +
                "1122.154 应收账款_河北康明电气设备安装工程有限公司\n" +
                "1002.01 银行存款_基本户1612\n" +
                "\n" +
                "2202.07 应付账款_新乡市黄淮机械设备有限公司\n" +
                "1001库存现金\n" +
                "\n" +
                "1122.103 应收账款_新乡市昊创电力技术有限公司\n" +
                "1122.155 应收账款_浙江安尔吾智能科技有限公司\n" +
                "1122.89 应收账款_许昌智能继电器股份有限公司\n" +
                "1002.01 银行存款_基本户1612\n" +
                "\n" +
                "1122.72 应收账款_深圳市宝创电气有限公司\n" +
                "1122.26 应收账款_广东卓立变压器有限公司\n" +
                "1122.85应收账款_温州郎韵工贸\n" +
                "1122.64 应收账款_瓯越电力科技有限公司\n" +
                "1002.01 银行存款_基本户1612\n" +
                "\n" +
                "1122.94 应收账款_浙江吉控电气有限公司\n" +
                "1122.135 应收账款_易仁通电气集团股份有限公司\n" +
                "1002.01 银行存款_基本户1612\n" +
                "\n" +
                "2221.02应交税费_未交增值税\n" +
                "2221.04应交税费_应交城市维护建设税\n" +
                "2221.06应交税费_教育费附加\n" +
                "2221.07应交税费_地方教育费附加\n" +
                "2221.03应交税费_应交企业所得税\n" +
                "1002.01 银行存款_基本户1612\n" +
                "\n" +
                "5602.13管理费用_工会经费\n" +
                "5602.12管理费用_印花税\n" +
                "5602.15管理费用_土地使用税\n" +
                "5602.14管理费用_房产税\n" +
                "1002.01 银行存款_基本户1612\n" +
                "\n" +
                "5901以前年度损益调整\n" +
                "1002.01 银行存款_基本户1612\n" +
                "\n" +
                "1122.30 应收账款_浙江三狮电器设备有限公司\n" +
                "5001.01.02主营业务收入_销货收入_电压互感器\n" +
                "2221.01.03应交税费_应交增值税_销项税额\n" +
                "\n" +
                "1002.01 银行存款_基本户1612\n" +
                "1122.35 应收账款_深圳市法尔克配电设备有限公司\n" +
                "1122.84 应收账款_郑州凯诚电气设备有限公司\n" +
                "1122.22 应收账款_南阳宏翔电气设备有限公司\n" +
                "5001.01.01主营业务收入_销货收入_电流互感器\n" +
                "5001.01.04主营业务收入_销货收入_零序电流\n" +
                "5001.01.02主营业务收入_销货收入_电压互感器\n" +
                "2221.01.03应交税费_应交增值税_销项税额\n" +
                "\n" +
                "1122.28 应收账款_浙江图润电力科技有限公司\n" +
                "1122.156 应收账款_深圳市超越电气技术有限公司\n" +
                "1122.59 应收账款_深圳佳源电业有限公司\n" +
                "5001.01.02主营业务收入_销货收入_电压互感器\n" +
                "2221.01.03应交税费_应交增值税_销项税额\n" +
                "\n" +
                "1122.96 应收账款_品诺电气科技有限公司\n" +
                "1122.21 应收账款_河南省顺海电器有限公司\n" +
                "5051.01.01其他业务收入_销售材料收入_熔断器\n" +
                "5001.01.01主营业务收入_销货收入_电流互感器\n" +
                "5001.01.02主营业务收入_销货收入_电压互感器\n" +
                "2221.01.03应交税费_应交增值税_销项税额\n" +
                "\n" +
                "1122.60 应收账款_河南中坤实业有限公司\n" +
                "1122.109 应收账款_河南昊锐电气有限公司\n" +
                "5001.01.01主营业务收入_销货收入_电流互感器\n" +
                "5001.01.02主营业务收入_销货收入_电压互感器\n" +
                "2221.01.03应交税费_应交增值税_销项税额\n" +
                "\n" +
                "1122.130 应收账款_山西煜众电力科技有限公司\n" +
                "1122.129 应收账款_江苏贝力嘉电气有限公司扬中分公司\n" +
                "5001.01.01主营业务收入_销货收入_电流互感器\n" +
                "2221.01.03应交税费_应交增值税_销项税额\n" +
                "\n" +
                "1122.19 应收账款_安徽蓝翔电器成套设备有限公司\n" +
                "1122.100 应收账款_丰峰电气集团河北有限公司\n" +
                "5001.01.01主营业务收入_销货收入_电流互感器\n" +
                "5001.01.02主营业务收入_销货收入_电压互感器\n" +
                "2221.01.03应交税费_应交增值税_销项税额\n" +
                "\n" +
                "1122.107 应收账款_安耐吉电力设备（河南）有限公司\n" +
                "1122.128 应收账款_铭祺电气有限公司\n" +
                "5001.01.01主营业务收入_销货收入_电流互感器\n" +
                "5001.01.02主营业务收入_销货收入_电压互感器\n" +
                "2221.01.03应交税费_应交增值税_销项税额\n" +
                "\n" +
                "1122.01 应收账款_河北响铭电气设备有限公司\n" +
                "1122.157 应收账款_广东兴宏业电器有限公司\n" +
                "5001.01.01主营业务收入_销货收入_电流互感器\n" +
                "5001.01.02主营业务收入_销货收入_电压互感器\n" +
                "2221.01.03应交税费_应交增值税_销项税额\n" +
                "\n" +
                "1122.149 应收账款_郑州郑源电气有限公司\n" +
                "1122.54 应收账款_河南省汇科高压电器有限公司\n" +
                "5001.01.01主营业务收入_销货收入_电流互感器\n" +
                "5001.01.02主营业务收入_销货收入_电压互感器\n" +
                "2221.01.03应交税费_应交增值税_销项税额\n" +
                "\n" +
                "1122.20 应收账款_奇跃电器集团有限公司\n" +
                "5001.01.01主营业务收入_销货收入_电流互感器\n" +
                "5001.01.02主营业务收入_销货收入_电压互感器\n" +
                "5051.01.01其他业务收入_销售材料收入_熔断器\n" +
                "2221.01.03应交税费_应交增值税_销项税额\n" +
                "\n" +
                "1122.86 应收账款_江苏依斯特电力科技有限公司\n" +
                "1122.104 应收账款_浙江帕博电力科技有限公司\n" +
                "5001.01.01主营业务收入_销货收入_电流互感器\n" +
                "5001.01.02主营业务收入_销货收入_电压互感器\n" +
                "2221.01.03应交税费_应交增值税_销项税额\n" +
                "\n" +
                "1122.152 应收账款_深圳市科航兴电气有限公司\n" +
                "1122.94 应收账款_浙江吉控电气有限公司\n" +
                "1122.106 应收账款_耐思电力科技有限公司\n" +
                "5001.01.02主营业务收入_销货收入_电压互感器\n" +
                "2221.01.03应交税费_应交增值税_销项税额\n" +
                "\n" +
                "1122.158 应收账款_珠海欧力配网自动化股份有限公司\n" +
                "1122.151 应收账款_郑州威达电子有限公司\n" +
                "5001.01.02主营业务收入_销货收入_电压互感器\n" +
                "2221.01.03应交税费_应交增值税_销项税额\n" +
                "\n" +
                "1122.159 应收账款_浙江桂能电力科技有限公司\n" +
                "5001.01.01主营业务收入_销货收入_电流互感器\n" +
                "5001.01.02主营业务收入_销货收入_电压互感器\n" +
                "5051.01.01其他业务收入_销售材料收入_熔断器\n" +
                "2221.01.03应交税费_应交增值税_销项税额\n" +
                "\n" +
                "1122.32 应收账款_新乡市美凯达电气有限公司\n" +
                "1122.95 应收账款_湖南卓越慧能电力设备有限公司\n" +
                "1122.46 应收账款_河南中变电气有限公司\n" +
                "5001.01.02主营业务收入_销货收入_电压互感器\n" +
                "5001.01.01主营业务收入_销货收入_电流互感器\n" +
                "2221.01.03应交税费_应交增值税_销项税额\n" +
                "\n" +
                "1122.149 应收账款_郑州郑源电气有限公司\n" +
                "1122.103 应收账款_新乡市昊创电力技术有限公司\n" +
                "5001.01.01主营业务收入_销货收入_电流互感器\n" +
                "5001.01.02主营业务收入_销货收入_电压互感器\n" +
                "5051.01.01其他业务收入_销售材料收入_熔断器\n" +
                "2221.01.03应交税费_应交增值税_销项税额\n" +
                "\n" +
                "1001库存现金\n" +
                "1002.01 银行存款_基本户1612\n" +
                "1002.01 银行存款_基本户1612\n" +
                "1001库存现金";
        String[] split = str.split("\n");
        for (int i = 0; i < split.length; i++) {
            if(split[i].length() > 0){
                int start = firstChineseChar(split[i]);
                System.out.println(start +"  "+split[i].substring(0,start).trim()+"======>"+split[i].substring(start));
            }

        }

    }

    public static int firstChineseChar(String s) {
        for (int i = 0; i < s.length(); ) {
            int index = i;
            int codepoint = s.codePointAt(i);
            i += Character.charCount(codepoint);
            if (Character.UnicodeScript.of(codepoint) == Character.UnicodeScript.HAN) {
                return index;
            }
        }
        return -1;
    }
}
